Revit 2027 API
FabricationPart.SaveAsFabricationJob Method
 Save fabrication parts to an MEP job that can be opened in the fabrication software.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ISet<ElementId> SaveAsFabricationJob(
	Document document,
	ISet<ElementId> ids,
	string filename,
	FabricationSaveJobOptions saveOptions
)
Public Shared Function SaveAsFabricationJob (
	document As Document,
	ids As ISet(Of ElementId),
	filename As String,
	saveOptions As FabricationSaveJobOptions
) As ISet(Of ElementId)
public:
static ISet<ElementId^>^ SaveAsFabricationJob(
	Document^ document,
	ISet<ElementId^>^ ids,
	String^ filename,
	FabricationSaveJobOptions^ saveOptions
)
static member SaveAsFabricationJob :
        document : Document *
        ids : ISet<ElementId> *
        filename : string *
        saveOptions : FabricationSaveJobOptions -> ISet<ElementId>
Parameters
document Document
 The document.
ids ISet<ElementId>
 List of element Ids of fabrication parts or assemblies and group elements that contain fabrication parts to save. Non-fabrication part elements will be ignored.
filename String
 The full path and filename of the fabrication job to save.
saveOptions FabricationSaveJobOptions
 Options for the save operation.
Return Value
ISet<ElementId>
 Returns a list of fabrication part element Ids that were saved to the fabrication job.
Exceptions
Exception | Condition
ArgumentException |  Fabrication configuration is missing.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  the path to the filename must already exist and be writeable
InvalidPathArgumentException |  The destination file name includes one or more invalid characters.
Remarks
 Only fabrication MAJ files are supported.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace